In [200]:
import pandas as pd
import numpy as np

In [201]:
x_train = pd.read_csv('titanic_x_train.csv', encoding='cp949')
x_test = pd.read_csv('titanic_x_test.csv', encoding='cp949')
y_train = pd.read_csv('titanic_y_train.csv')

In [202]:
x_train.head()

,PassengerId,티켓등급,승객이름,성별,나이,형제자매배우자수,부모자식수,티켓번호,운임요금,객실번호,선착장
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [203]:
y_train.head()

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0

In [204]:
data = pd.concat([x_train,y_train['Survived']], axis=1)
data.head()
data.groupby('선착장')['Survived'].mean()

선착장
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [205]:
x_test_id = x_test['PassengerId']
x_test_id

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [206]:
x_train = x_train.drop(columns=['PassengerId'])
x_test = x_test.drop(columns=['PassengerId'])
y_train = y_train.drop(columns=['PassengerId'])

In [207]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   티켓등급         891 non-null    int64
 2   승객이름         891 non-null    object
 3   성별           891 non-null    object
 4   나이           714 non-null    float64
 5   형제자매배우자수     891 non-null    int64
 6   부모자식수        891 non-null    int64
 7   티켓번호         891 non-null    object
 8   운임요금         891 non-null    float64
 9   객실번호         204 non-null    object
 10  선착장          889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [208]:
sex_dummies = pd.get_dummies(x_train['성별'])
x_train = pd.concat([x_train, sex_dummies], axis=1)
x_train = x_train.drop(columns=['성별'])

sex_dummies = pd.get_dummies(x_test['성별'])
x_test = pd.concat([x_test, sex_dummies], axis=1)
x_test = x_test.drop(columns=['성별'])

In [209]:
x_train = x_train.drop(columns=['승객이름'])
x_test = x_test.drop(columns=['승객이름'])

In [210]:
x_train = x_train.drop(columns=['티켓번호'])
x_test = x_test.drop(columns=['티켓번호'])

In [211]:
x_train = x_train.drop(columns=['객실번호'])
x_test = x_test.drop(columns=['객실번호'])

In [212]:
x_train

     티켓등급    나이  형제자매배우자수  부모자식수     운임요금 선착장  female  male
0       3  22.0         1      0   7.2500   S       0     1
1       1  38.0         1      0  71.2833   C       1     0
2       3  26.0         0      0   7.9250   S       1     0
3       1  35.0         1      0  53.1000   S       1     0
4       3  35.0         0      0   8.0500   S       0     1
..    ...   ...       ...    ...      ...  ..     ...   ...
886     2  27.0         0      0  13.0000   S       0     1
887     1  19.0         0      0  30.0000   S       1     0
888     3   NaN         1      2  23.4500   S       1     0
889     1  26.0         0      0  30.0000   C       0     1
890     3  32.0         0      0   7.7500   Q       0     1

[891 rows x 8 columns]

In [213]:
x_train['가족수'] = x_train['형제자매배우자수'] + x_train['부모자식수']
x_test['가족수'] = x_test['형제자매배우자수'] + x_test['부모자식수']
x_train = x_train.drop(columns=['형제자매배우자수','부모자식수'])
x_test = x_test.drop(columns=['형제자매배우자수','부모자식수'])

In [214]:
x_train

     티켓등급    나이     운임요금 선착장  female  male  가족수
0       3  22.0   7.2500   S       0     1    1
1       1  38.0  71.2833   C       1     0    1
2       3  26.0   7.9250   S       1     0    0
3       1  35.0  53.1000   S       1     0    1
4       3  35.0   8.0500   S       0     1    0
..    ...   ...      ...  ..     ...   ...  ...
886     2  27.0  13.0000   S       0     1    0
887     1  19.0  30.0000   S       1     0    0
888     3   NaN  23.4500   S       1     0    3
889     1  26.0  30.0000   C       0     1    0
890     3  32.0   7.7500   Q       0     1    0

[891 rows x 7 columns]

In [215]:
board = pd.get_dummies(x_train['선착장'], drop_first=True).rename(columns={'Q':'선착장Q','S':'선착장S'})
x_train = pd.concat([x_train,board],axis=1)

board = pd.get_dummies(x_test['선착장'], drop_first=True).rename(columns={'Q':'선착장Q','S':'선착장S'})
x_test = pd.concat([x_test,board],axis=1)

x_train = x_train.drop(columns=['선착장'])
x_test = x_test.drop(columns=['선착장'])
x_train = x_train.drop(columns=['나이'])
x_test = x_test.drop(columns=['나이'])

In [216]:
data = pd.concat([x_train,y_train],axis=1)
data.corr()

,티켓등급,운임요금,female,male,가족수,선착장Q,선착장S,Survived
티켓등급,1.000000,-0.549500,-0.131900,0.131900,0.065997,0.221009,0.081720,-0.338481
운임요금,-0.549500,1.000000,0.182333,-0.182333,0.217138,-0.117216,-0.166603,0.257307
female,-0.131900,0.182333,1.000000,-1.000000,0.200988,0.074115,-0.125722,0.543351
male,0.131900,-0.182333,-1.000000,1.000000,-0.200988,-0.074115,0.125722,-0.543351
가족수,0.065997,0.217138,0.200988,-0.200988,1.000000,-0.058592,0.079977,0.016639
선착장Q,0.221009,-0.117216,0.074115,-0.074115,-0.058592,1.000000,-0.496624,0.003650
선착장S,0.081720,-0.166603,-0.125722,0.125722,0.079977,-0.496624,1.000000,-0.155660
Survived,-0.338481,0.257307,0.543351,-0.543351,0.016639,0.003650,-0.155660,1.000000

In [217]:
from sklearn.model_selection import train_test_split
X_TRAIN,X_TEST,Y_TRAIN,Y_TEST = train_test_split(x_train, y_train, test_size=0.2)

In [218]:
print(X_TRAIN.shape)
print(X_TEST.shape)
print(Y_TRAIN.shape)
print(Y_TEST.shape)

(712, 7)
(179, 7)
(712, 1)
(179, 1)

In [219]:
from xgboost import XGBClassifier
model = XGBClassifier(n_estimators=100, max_depth=5)
model.fit(X_TRAIN,Y_TRAIN)

[16:41:12] WARNING: /var/folders/sy/f16zz6x50xz3113nwtb9bvq00000gp/T/abs_44tbtwf8c1/croots/recipe/xgboost-split_1659548960882/work/src/learner.cc:1115: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/xgboost/sklearn.py:1224: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/sklearn/preprocessing/_label.py:98: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/sklearn/preprocessing/_label.py:133: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/heetaecho/opt/anaconda3/lib/python3.9/site-packages/xgboost/data.py:250: FutureWarning: pandas.Int64Index is deprecated and will be removed from pandas in a future version. Use pandas.Index with the appropriate dtype instead.
  elif isinstance(data.columns, (pd.Int64Index, pd.RangeIndex)):

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, enable_categorical=False,
              gamma=0, gpu_id=-1, importance_type=None,
              interaction_constraints='', learning_rate=0.300000012,
              max_delta_step=0, max_depth=5, min_child_weight=1, missing=nan,
              monotone_constraints='()', n_estimators=100, n_jobs=8,
              num_parallel_tree=1, predictor='auto', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', validate_parameters=1, verbosity=None)

In [220]:
Y_TEST_PREDICTED = pd.DataFrame(model.predict(X_TEST)).rename(columns={0:'SURVIVED'})
Y_TEST_PREDICTED

     SURVIVED
0           0
1           0
2           0
3           1
4           0
..        ...
174         0
175         1
176         1
177         1
178         1

[179 rows x 1 columns]

In [221]:
from sklearn.metrics import roc_auc_score
roc_auc_score(Y_TEST,Y_TEST_PREDICTED)

0.7455163043478261